In [2]:
import pandas as pd
import numpy as np

In [43]:
input_df = [{'name':'Sujeet', 'age':10},
            {'name':'Sameer', 'age':11},
            {'name':'Sumit', 'age':12}]
  
df = pd.DataFrame(input_df)

In [44]:
df

     name  age
0  Sujeet   10
1  Sameer   11
2   Sumit   12

# Iterating using itterows()

In [45]:
for index,rows in df.iterrows():
    print(rows["name"],rows["age"])

Sujeet 10
Sameer 11
Sumit 12

In [1]:
data = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'],
                'Age': [21, 19, 20, 18],
                'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
                'Percentage': [88, 92, 95, 70]}

df1 = pd.DataFrame(data, columns = ['Name', 'Age', 'Stream', 'Percentage'])

NameError: name 'pd' is not defined

In [59]:
df1

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

# Iterating using index

In [61]:
for ind in df1.index:
     print(df1['Name'][ind], df1['Stream'][ind])

Ankit Math
Amit Commerce
Aishwarya Arts
Priyanka Biology

In [63]:
data1 = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'],
                'Age': [21, 19, 20, 18],
                'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
                'Percentage': [88, 92, 95, 70]}
  
df2 = pd.DataFrame(data1, columns = ['Name', 'Age', 'Stream', 'Percentage'])

In [64]:
df2

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

# Iterating using .loc[]

In [66]:
for i in range(len(df)):
    print(df2.loc[i,"Name"],df2.loc[i,"Age"])

Ankit 21
Amit 19
Aishwarya 20

In [4]:
data2 = {'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka'],
                'Age': [21, 19, 20, 18],
                'Stream': ['Math', 'Commerce', 'Arts', 'Biology'],
                'Percentage': [88, 92, 95, 70]}
  
df4 = pd.DataFrame(data2, columns = ['Name', 'Age', 'Stream', 'Percentage'])

In [9]:
df4

        Name  Age    Stream  Percentage
0      Ankit   21      Math          88
1       Amit   19  Commerce          92
2  Aishwarya   20      Arts          95
3   Priyanka   18   Biology          70

# Iterating using iloc[]

In [12]:
for i in range(len(df4)):
    
    print(df4.iloc[i,0])
    i=i+1

Ankit
Amit
Aishwarya
Priyanka

In [86]:
for i in range(len(df)+1):
    print(df4.iloc[i,:])

Name          Ankit
Age              21
Stream         Math
Percentage       88
Name: 0, dtype: object
Name              Amit
Age                 19
Stream        Commerce
Percentage          92
Name: 1, dtype: object
Name          Aishwarya
Age                  20
Stream             Arts
Percentage           95
Name: 2, dtype: object
Name          Priyanka
Age                 18
Stream         Biology
Percentage          70
Name: 3, dtype: object